Config/DataProcessors/SendOnlineCheckInInvitation.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>SendOnlineCheckInInvitation</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CheckInDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GuestGroup</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.GuestGroups</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Template</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SMSTemplates</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DataProcessor</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ReservationStatus</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ReservationStatuses</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/Catalogs/ObjectPrintingForms.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ObjectPrintingForms</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ObjectType</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Language</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Languages</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Report</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Reports</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalProcessing</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ExternalDataProcessors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplate</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileName</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileLoadTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ExternalTemplateFileLastChangeTime</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Parameter</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Width</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Copies</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FormText</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AutomaticallyPrintOnFirstObjectWrite</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>PrintFormPreview</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Remarks</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsDefault</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>IsActive</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/DataProcessors/SendOnlineCheckInInvitation/Ext/ObjectModule.bsl
#Region Public

// -----------------------------------------------------------------------------
Procedure pmLoadDataProcessorAttributes(pParameter = Undefined) Export
	If TypeOf(pParameter) = Type("CatalogRef.GuestGroups") Then
		GuestGroup = pParameter.Ref;
	EndIf;
	cmLoadDataProcessorAttributes(ThisObject, pParameter);
EndProcedure // pmLoadDataProcessorAttributes

// -----------------------------------------------------------------------------
// Initialize attributes with default values
// Attention: This procedure could be called AFTER some attributes initialization
// routine, so it SHOULD NOT reset attributes being set before
// -----------------------------------------------------------------------------
Procedure pmFillAttributesWithDefaultValues() Export
	If Not ValueIsFilled(Template) Then
		If ValueIsFilled(Hotel) Then
			Template = Hotel.TemplateSendOnlineCheckinInvitation;
		EndIf;
	EndIf;
	If Not ValueIsFilled(CheckInDate) Then
		CheckInDate = CurrentSessionDate() + 2*86400;
	EndIf;
EndProcedure // pmFillAttributesWithDefaultValues

// -----------------------------------------------------------------------------
// Run data processor in silent mode
// -----------------------------------------------------------------------------
Procedure pmRun(pParameter = Undefined, pIsInteractive = False) Export
	pmSendInvitationByEmail(pIsInteractive);
EndProcedure // pmRun

#EndRegion

#Region Internal

// -----------------------------------------------------------------------------
Procedure pmSaveDataProcessorAttributes() Export
	cmSaveDataProcessorAttributes(ThisObject);
EndProcedure // pmSaveDataProcessorAttributes()

// -----------------------------------------------------------------------------
// Run data processor in silent mode
// -----------------------------------------------------------------------------
Procedure pmSendInvitationByEmail(pIsInteractive = False) Export
	vTabDocs = GetReservationsToSend();
	For Each vResRow In vTabDocs Do 
		Send(vResRow.Ref, pIsInteractive);
	EndDo;
EndProcedure // pmSendInvitationByEmail()

#EndRegion

#Region Private

// -----------------------------------------------------------------------------
Function GetReservationsToSend()
	
	vQry = New Query;
	vQry.Text = "SELECT
	            |	Reservation.Ref AS Ref
	            |FROM
	            |	Document.Reservation AS Reservation
	            |WHERE
	            |	Reservation.Posted = TRUE
	            |	AND CASE
	            |			WHEN &qHotelIsEpty
	            |				THEN TRUE
	            |			ELSE Reservation.Hotel = &qHotel
	            |		END
	            |	AND CASE
	            |			WHEN &qCheckInDateIsEmpty
	            |				THEN TRUE
	            |			ELSE BEGINOFPERIOD(Reservation.CheckInDate, DAY) = &qCheckInDate
	            |		END
	            |	AND CASE
	            |			WHEN &qReservationStatusIsEmpty
	            |				THEN Reservation.ReservationStatus.IsActive
	            |			ELSE Reservation.ReservationStatus = &qReservationStatus
	            |		END
	            |	AND CASE
	            |			WHEN &qGuestGroupIsEmpty
	            |				THEN TRUE
	            |			ELSE Reservation.GuestGroup = &qGuestGroup
	            |		END";
	
	vQry.SetParameter("qCheckInDateIsEmpty", Not ValueIsFilled(CheckInDate));
	vQry.SetParameter("qCheckInDate", BegOfDay(CheckInDate)); 
	
	vQry.SetParameter("qGuestGroupIsEmpty", Not ValueIsFilled(GuestGroup));
	vQry.SetParameter("qGuestGroup", GuestGroup);
	
	vQry.SetParameter("qReservationStatusIsEmpty", Not ValueIsFilled(ReservationStatus));
	vQry.SetParameter("qReservationStatus", ReservationStatus); 
	
	vQry.SetParameter("qHotelIsEpty", Not ValueIsFilled(Hotel));
	vQry.SetParameter("qHotel", Hotel);
	
	Return vQry.Execute().Unload();
	
EndFunction // FindReservationsToSend()

// -----------------------------------------------------------------------------
Procedure Send(pDoc, pIsInteractive = False)
	vLanguage = pDoc.Guest.Language;
	
	vText = "";
	If ValueIsFilled(Template.HTMLTextRu) Or ValueIsFilled(Template.HTMLTextEn) Or ValueIsFilled(Template.HTMLTextDe) Then
		vText = SMS.GetHTMLTextByLanguage(Template, vLanguage);
	EndIf;
	If IsBlankString(vText) Then
		vText = SMS.GetSMSTextByLanguage(Template, vLanguage);
	EndIf;
	If Not IsBlankString(vText) Then
		vText = SMS.ReplaceSMSParameters(vText, pDoc);
	EndIf;
	
	vEmailAddress = ?(ValueIsFilled(pDoc.Email), pDoc.Email, ?(ValueIsFilled(pDoc.Guest), pDoc.Guest.Email, ""));
	
	vObjectPrintForm = Template.ObjectPrintingFormRu;
	If vLanguage = Catalogs.Languages.EN Then
		vObjectPrintForm = Template.ObjectPrintingFormEn;
	ElsIf  vLanguage = Catalogs.Languages.DE Then 
		vObjectPrintForm = Template.ObjectPrintingFormDe;
	EndIf;
	
	If ValueIsFilled(vObjectPrintForm) And ValueIsFilled(pDoc) And TypeOf(pDoc) = Type("DocumentRef.Reservation") Then
		vDocObj = pDoc.GetObject();
		vPrintFormSpreadsheet = New SpreadsheetDocument();
		If ValueIsFilled(vObjectPrintForm.ExternalProcessing) Then
			vExtDataProcessor = cmGetExternalDataProcessorObject(vObjectPrintForm.ExternalProcessing);
			vExtDataProcessor.pmPrintConfirmation(vPrintFormSpreadsheet, pDoc, Undefined, 0, Catalogs.ServiceGroups.EmptyRef(), False, vLanguage, vObjectPrintForm);
		ElsIf ValueIsFilled(vObjectPrintForm.Report) Then
			vRepObj = cmBuildReportObject(vObjectPrintForm.Report);
			If vRepObj <> Undefined Then
				// Fill reference to the report catalog item
				vRepObj.Report = vObjectPrintForm.Report;
				// Load report catalog item attributes
				vRepObj.pmLoadReportAttributes(pDoc);
				// Generate print form
				vRepObj.pmGenerate(vPrintFormSpreadsheet);
			EndIf;
		Else
			If vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintConfirmationWithServicesRu Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintConfirmationWithServicesEn Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintConfirmationWithServicesDe Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCurrentDocConfirmationWithServicesRu Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCurrentDocConfirmationWithServicesEn Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCurrentDocConfirmationWithServicesDe Then
				vDocObj.pmPrintConfirmationWithServices(vPrintFormSpreadsheet, pDoc, Undefined, 0, Catalogs.ServiceGroups.EmptyRef(), False, vLanguage, vObjectPrintForm);
			ElsIf vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCancellationRu Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCancellationEn Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintCancellationDe Then
				vDocObj.pmPrintCancellation(vPrintFormSpreadsheet, pDoc, Undefined, False, vLanguage, vObjectPrintForm);
			ElsIf vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintExpressCheckInInvitationRu Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintExpressCheckInInvitationEn Or
				vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintExpressCheckInInvitationDe Then
				vDocObj.pmPrintExpressCheckInInvitation(vPrintFormSpreadsheet, pDoc, Undefined, False, vLanguage, vObjectPrintForm);
			ElsIf vObjectPrintForm = Catalogs.ObjectPrintingForms.ReservationPrintPaymentOrder Then
				vDocObj.pmPrintPaymentOrder(vPrintFormSpreadsheet, pDoc, pDoc.GetObject(), Undefined, Undefined, vLanguage, vObjectPrintForm);
			Else
				vDocObj.pmPrintConfirmation(vPrintFormSpreadsheet, pDoc, Undefined, 0, Catalogs.ServiceGroups.EmptyRef(), False, vLanguage, vObjectPrintForm);
			EndIf;
		EndIf;
		vResFileNumber = "";
		If Find(vObjectPrintForm.Parameter, "USE_INDIVIDUAL_RESERVATION_NUMBER_FOR_FILE") > 0 Then
			vResFileNumber = vDocObj.Number;
		Else
			vResFileNumber = Format(vDocObj.GuestGroup.Code, "ND=12; NFD=0; NG=");
		Endif;
		// Save reservation confirmation to the temp PDF file
		vPrintFormFileName = StrReplace(pDoc.Metadata().Presentation() + " " + vResFileNumber, " ", "_") + ".pdf";
		vPrintFormFilePath = cmGetFullFileName(vPrintFormFileName, TempFilesDir());
		vPrintFormSpreadsheet.Write(vPrintFormFilePath, SpreadsheetDocumentFileType.PDF);
	EndIf;
	
	vCheckResult = "";
	If Not JobsScheduled.cmSendTextByEMail(cmNStr(Template.Description, vLanguage), TrimAll(vText), TrimAll(vEmailAddress), False,,,, vPrintFormFilePath, Template, pDoc) Then
		vCheckResult = cmNStr("ru='Сообщение не отправлено!'; en='The message was not sent'; de='The message was not sent'");
	Else
		vCheckResult = cmNStr("ru='Сообщение отправлено!'; en='The message was sent'; de='Die Nachricht wurde gesendet'", vLanguage);
	EndIf;
	If pIsInteractive Then
		tcCommonFunctionOnClientServer.TextMessage(vCheckResult, MessageStatus.Information);
	EndIf;
EndProcedure // Send()

#EndRegion
